<script setup>
import { ref } from 'vue'

const show = ref(false)
</script>

<template>
  <div class="flex flex-col justify-start text-start">
    <span class="cursor-pointer font-medium" @click="() => (show = !show)">Публичная оферта</span>
    <div class="flex flex-col text-start" v-if="show">
      <p>1. Клиенты — физические лица.</p>
      <p>2. Предмет — подарки и подарочные наборы на Новый год.</p>
      <p>
        3. Договор считается заключенным на неопределенный срок с момента акцепта оферты — полной
        оплаты услуги.
      </p>
      <p>
        4. Магазин вправе изменить оферту и договор. Изменения вступают в силу через 3 дня с момента
        публикации на сайте vue-shop-gifts.vercel.app.
      </p>
      <p>5. Стоимость, описание и фото-карточки товаров — на странице каждого подарка.</p>
      <p>6. Клиенты оплачивают товары по безналичному расчету.</p>
      <p>7. Магазин и клиенты не подписывают акты. Оплата подтверждает качество услуг.</p>
      <p>
        8. Магазин предоставляет клиентам право использовать приобретённые товары в личных целях и
        ничего больше.
      </p>
    </div>
  </div>
</template>

<style scoped></style>
